export const MSG = {
    conversations: {
        chooseTagName:
            'Введи коротку назву тегу по якому бот буде розуміти що потрібно застосувати сповіщення.\n\nВказувати потрібно без будь яких спец символів.\nНаприклад: <i>all</i>, <i>admin</i>. Кінцевий результат буде #all, #admin, саме за таким тегом бот буде розуміти що потрібно застосувати сповіщення.',
        chooseTagTitle:
            'Введи симантичну назву тегу, щоб розуміти про що цей тег.\n\nНаприклад: <i>Ввіділ маркетингу</i>',
        leaveConversation: 'Розмову завершено.',
        invalidInput: 'Введіть назву тегу від 3 до 20 символів, не використовуючи спец символів!'
    },
    menu: {
        text: {
            start: `Привіт, ти можеш керувати налаштуваннями роботи бота.\n\n`,
            setupAdmin:
                'Ти можеш вибрати кому з користувачів групи надати або позбавити ролі admin\n\nРоль admin дозволяє взаємодіяти з ботом, та бот буде слідкувати за повідомленнями адмінів в групі.',
            setupTag: 'Створи тег та додай людей до цього тегу.',
            addAdmin: 'Вибери кому дати роль адміна',
            removeAdmin: 'Вибери у кого забрати роль адміна',
        },
        buttons: {
            setupAdmins: 'Адміни',
            addAdmin: 'Додати адміна',
            removeAdmin: 'Видалити адміна',
            setupTags: 'Теги',
            createTag: 'Створити тег',
            updateTag: 'Редагувати тег',
            removeTag: 'Видалити тег',
            back: '<< Назад',
            approve: '✅ Прийняти',
            add: '✅ Додати',
            update: '🔄 Оновити',
            send: '📩 Надіслати',
            cancel: '🚫 Скасувати',
            backToMain: 'До головного меню',
        },
    },
};
